robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2foc-icubProto/app-added/can_icubProto_parser.c

/*
 * Copyright (C) 2011 Department of Robotics Brain and Cognitive Sciences - Istituto Italiano di Tecnologia
 * Author: Valentina Gaggero
 * email:   valentina.gaggero@iit.it
 * website: www.robotcub.org
 * Permission is granted to copy, distribute, and/or modify this program
 * under the terms of the GNU General Public License, version 2 or any
 * later version published by the Free Software Foundation.
 *
 * A copy of the license can be found at
 * http://www.robotcub.org/icub/license/gpl.txt
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General
 * Public License for more details
*/

#include <p33FJ128MC802.h>
#include <string.h>

#include "ecan.h"
#include "UserParms.h"
#include "tle5012.h"
#include "controller.h"
#include "system.h"
#include "Status.h"
#include "IControl.h"
#include "DSP.h"
#include "can_icubProto_parser.h"
#include "can_icubProto_trasmitter.h"
#include "EmuROM.h"
#include "can_icubProto.h"
#include "faults.h"


#define ICUBPROTO_PAYLOAD_ERROR_SET(txpayload_ptr, txlen_ptr, error_code)\
{ \
	*txlen_ptr = 0x1; \
	txpayload->b[0] = error_code; \
}


__inline__ static void s_controlMode_reset(void)
{
    SysStatus.b[0] = SysStatus.b[0] & 0x03;
}

/*the default control mode is current*/
__inline__ static void s_controlMode_setDefault(void) 
{
    SysStatus.b[0] |= (1 << 6);
}


__inline__ static void s_controlMode_setCurrent(void)
{ 
    SysStatus.b[0] |= (1 << 6);
}


__inline__ static void s_controlMode_setVelocity(void)
{
    SysStatus.b[0] |= (1 << 5);
}
 



static unsigned char canprotoparser_bid;

static int s_canIcubProtoParser_parse_pollingMsg(tCanData *rxpayload, unsigned char rxlen, tCanData *txpayload, unsigned char *txlen);
static int s_canIcubProtoParser_parse_periodicMsg(unsigned char permsg_type, tCanData *rxpayload, unsigned char rxlen, tCanData *txpayload, unsigned char *txlen);
static int s_canIcubProtoParser_parse_canLoaderMsg(tCanData *rxpayload, unsigned char rxlen, tCanData *txpayload, unsigned char *txlen);

extern volatile unsigned char received_canloader_msg;
extern volatile unsigned char current_open_loop;

void CanIcubProtoParserInit(unsigned char bid)
{
	canprotoparser_bid = bid;
}
// Parse CAN messages complient wit icub can protocol
void CanIcubProtoParserParse(unsigned long rxid, unsigned char rxlen, tCanData *rxpayload)
{
  // Command Syntax ok  
  int command_ok=1;
  unsigned char txlen = 0;
  unsigned char msg_class = 255;
  unsigned char source, permsg_type;
  tCanData txpayload;
  unsigned long resp_id=0;
  
   msg_class = CAN_ICUBPROTO_STDID_GETCLASS(rxid);
   source = CAN_ICUBPROTO_STDID_RX_GETSOURCE(rxid);
   permsg_type = CAN_ICUBPROTO_STDID_RX_GETPERMSGTYPE(rxid);
  
    switch(msg_class)
    {
        case ICUBCANPROTO_CLASS_POLLING_MOTORCONTROL:
        {
            command_ok = s_canIcubProtoParser_parse_pollingMsg(rxpayload, rxlen, &txpayload, &txlen);
        }break;
        
        case ICUBCANPROTO_CLASS_PERIODIC_MOTORCONTROL:
        {
            command_ok = s_canIcubProtoParser_parse_periodicMsg(permsg_type, rxpayload, rxlen, &txpayload, &txlen);
        }break;
        
        case ICUBCANPROTO_CLASS_BOOTLOADER:
        {
            command_ok = s_canIcubProtoParser_parse_canLoaderMsg(rxpayload, rxlen, &txpayload, &txlen);
        }break;
        
        default:
        {
//            txlen = 0x1;
//	        txpayload.b[0] =CAN_PROTO_ERROR_UNKNOWN_COMMAND; 
            txlen = 0x0;
            command_ok = 0;
        }
    }
    
    resp_id = CAN_ICUBPROTO_STDID_MAKE_TX(msg_class, canprotoparser_bid, source);
    if(command_ok)
    {
        if(txlen > 0)
        {
            CanIcubProtoSendResponse(resp_id, txlen, &txpayload);
        }
#ifdef CAN_ACK_EACH_COMMAND 
        else
        {
            CanIcubProtoTxAck(resp_id);
        }
#endif
    }
    else
    {
     ; //error. What i do??? // CanIcubProtoTxErrorCode(resp_id, txlen, &txpayload);
    }
}
//returns 1 ==> ok, retuns 0 ==> nok
static int s_canIcubProtoParser_parse_pollingMsg(tCanData *rxpayload, unsigned char rxlen, tCanData *txpayload, unsigned char *txlen)
{
    unsigned char cmd = rxpayload->b[0];
    
    *txlen = 0x0; 
    switch(cmd)
    {
        case ICUBCANPROTO_POL_MC_CMD__CONTROLLER_RUN: // DS402 Operation Enable 
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen=0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
         
            // Command can be accepted only if current ststus is SWITCHED ON 
            if(1 != DS402_Statusword.Flags.SwitchedOn )
            {
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_DS402_INVALID_STATUS_CHANGE;
                *txlen = 0x0;
                return(0);
            }
            
            //when start PWM ==> set the default control mode
            s_controlMode_reset();
           s_controlMode_setDefault();

            // go to Operation Enable state
            DS402_Controlword.Flags.EnableOperation = 1;       
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__DISABLE_PWM_PAD: // DS402 Operation Disable
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                  *txlen = 0;
                return(0);
            }
         
            // Command can be accepted only if current ststus is OPERATION ENABLE
            if ( (1 != DS402_Statusword.Flags.OperationEnabled ) && (1 != DS402_Statusword.Flags.SwitchedOn ) )
            {
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_DS402_INVALID_STATUS_CHANGE;
                  *txlen = 0;
                return(0);
            }
			// go to Ready to Switch On state
            DS402_Controlword.Flags.EnableVoltage = 0;   
            // In ICUB the states DISABLE_OPERATION and SHUTDOWN goes in the same state. 
            // go to Switched On state
            //DS402_Controlword.Flags.EnableOperation = 0;
        }break;
    
        case ICUBCANPROTO_POL_MC_CMD__ENABLE_PWM_PAD: // DS402 Switch On 
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0;
                return(0);
            }
            
			
            // Command can be accepted only if current ststus is SWITCH ON DISABLED 
            if(1 != DS402_Statusword.Flags.ReadyToSwitchOn )
            {
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_DS402_INVALID_STATUS_CHANGE;
                  *txlen = 0;
                  return(0);
            }
		
		    received_canloader_msg=0; // start to transmit status messages

            // go to Switch On state
            DS402_Controlword.Flags.SwitchOn = 1;
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__CONTROLLER_IDLE: // DS402 Shutdown
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            // Command can be accepted only if current ststus is OPERATION ENABLE or SWITCHED ON 
            if ( (1 != DS402_Statusword.Flags.OperationEnabled ) && (1 != DS402_Statusword.Flags.SwitchedOn ) )
            {
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_DS402_INVALID_STATUS_CHANGE;
                *txlen = 0x0;
                return(0);
            }

            // go to Ready to Switch On state
            DS402_Controlword.Flags.EnableVoltage = 0;   
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__GET_CONTROL_MODE:
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            
            txpayload->b[1] = CanIcubProtoGetcontrol_mode();
            if( controlMode_error == txpayload->b[1])
            {
//                *txlen = 0x1;
//                txpayload->b[0] =  CAN_ERROR_INCONSISTENT_STATE;
                *txlen = 0x0;
                return(0);
            }

