robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2foc-icubProto/app-added/can_icubProto_parser.c
            txpayload->b[0] = cmd;
            *txlen = 0x2;

        }break;

        case ICUBCANPROTO_POL_MC_CMD__SET_CONTROL_MODE:
        {
            if(2 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }

            //this command has effect only when i'm in enable operation state
            if(1 != DS402_Controlword.Flags.EnableOperation)
            {
//                *txlen = 0x1;
//                txpayload->b[1] = CAN_ERROR_COMMAND_IN_INVALID_STATE;
                *txlen = 0x0;
                return(0);    
            }

            //let change control mode on fly
            s_controlMode_reset();

            switch(rxpayload->b[1])
            {           
                case icubCanProto_controlmode_current:
                {
                    SysStatus.TorqueControl = 1;
					current_open_loop=0;
                }break;
                case icubCanProto_controlmode_velocity:
                {
                    SysStatus.SpeedControl = 1;
                }break;
                
                case icubCanProto_controlmode_idle:
                {
                    // go to Switched On state
                    DS402_Controlword.Flags.EnableOperation = 0;
                }break;

                case icubCanProto_controlmode_position:
				{
				}break;
                case icubCanProto_controlmode_openloop:
				{
					SysStatus.TorqueControl = 1;
					current_open_loop=1;
				}break;	
                case icubCanProto_controlmode_torque:
                {
                   s_controlMode_setDefault();
                }break;
 
                default:
                {
                    s_controlMode_setDefault();
                }break;
            }

        }break;

        case ICUBCANPROTO_POL_MC_CMD__WRITE_FLASH_MEM:
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
#ifndef CAN_CMD_ALWAYS_ACCEPT
            if ( (1 != DS402_Statusword.Flags.OperationEnabled ) && (1 != DS402_Statusword.Flags.SwitchedOn ) )
            {
              *txlen=0x1;
              txpayload->b[0] =  CAN_ERROR_COMMAND_IN_INVALID_STATE;
              return(0);
            }
#endif
            EepromSave();
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__GET_ADDITIONAL_INFO:
        {
            ;   //todo
        }break;

        case ICUBCANPROTO_POL_MC_CMD__SET_ADDITIONAL_INFO:
        {
            ;   //todo
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__GET_DESIRED_VELOCITY: 
        {
            ;  //todo 
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__SET_DESIRED_VELOCITY: 
        {
            ;  //todo 
        }break;

        case ICUBCANPROTO_POL_MC_CMD__SET_ENCODER_POSITION: 
        {
            
		// setta l'offset di fasatura 
		Encoder_SyncPulsePosition=(rxpayload->b[2] << 8 | rxpayload->b[1]);  //todo aspetta maggia
        }break;
        
        
        case ICUBCANPROTO_POL_MC_CMD__GET_BOARD_ID: 
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            *txlen = 0x2;
            txpayload->b[0] = cmd;
            txpayload->b[1] = canprotoparser_bid;
        }break;

        case ICUBCANPROTO_POL_MC_CMD__SET_BOARD_ID: 
        {
//            *txlen=0x1;
//             txpayload->b[0] = CAN_PROTO_ERROR_COMMAND_NOT_INPLEMENTED;
              *txlen=0x0;
             return(0);
            
            /* currently it is NOT possible change board can address, 
            so the code below is commented, but it is right. */

//            if(2 != rxlen)
//            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
//                return(0);
//            }
//#ifndef CAN_CMD_ALWAYS_ACCEPT
//            if ( (1 != DS402_Statusword.Flags.OperationEnabled ) && (1 != DS402_Statusword.Flags.SwitchedOn ) )
//            {
//              *txlen=0x1;
//              txpayload->b[0] =  CAN_ERROR_COMMAND_IN_INVALID_STATE;
//              return(0);
//            }
//#endif
//            ApplicationData.EepromHeader.EE_CAN_BoardAddress = rxpayload->b[1];
//            canprotoparser_bid = rxpayload->b[1];
//            CanIcubProtoTransmitterUpdateBoardId(canprotoparser_bid);
//            CanIcubProtoSetFilters(canprotoparser_bid);
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__SET_MAX_VELOCITY: 
        {
            ; //aspetta maggia
			//
        }break;

        case ICUBCANPROTO_POL_MC_CMD__GET_MAX_VELOCITY: 
        {
            ; //aspetta maggia
        }break;

        case ICUBCANPROTO_POL_MC_CMD__SET_CURRENT_LIMIT: 
        {
         
			
			if(5 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
		
		//il dato che arriva è espresso in mA va trasformato in IAD della 2FOC (1A 1310) 
			ApplicationData.CurLimit=((rxpayload->b[2] << 8 | rxpayload->b[1])*1310)/1000;
 
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__GET_FIRMWARE_VERSION: 
        {
            ; //todo da leggere dalla partizione giusta della eeprom
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__SET_CURRENT_PID: 
        {
            SFRAC16 pp, pi, pd, pm; //pm non viene passato dal comando 

            if(7 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            ControllerGetCurrentDPIDParm(&pp,&pi,&pd,&pm);
            pp = (rxpayload->b[2] << 8 | rxpayload->b[1]);
            pi = (rxpayload->b[4] << 8 | rxpayload->b[3]);
            pd = (rxpayload->b[6] << 8 | rxpayload->b[5]);

            ControllerSetCurrentDPIDParm(pp,pi,pd,pm);
	    ControllerSetCurrentQPIDParm(pp,pi,pd,pm);
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__GET_CURRENT_PID: 
        {
            signed int p, i, d, m; 
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            
            ControllerGetCurrentDPIDParm(&p, &i, &d, &m);
            txpayload->b[0] = cmd;
            memcpy(&txpayload->b[1], &p, 2);
            memcpy(&txpayload->b[3], &i, 2);
            memcpy(&txpayload->b[5], &d, 2);
            *txlen = 0x7;   
        }break;
        
        case ICUBCANPROTO_POL_MC_CMD__SET_VELOCITY_PID: 
        {
            SFRAC16 pp, pi, pd, pm; //pm non viene passato dal comando 
            
            if(7 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
            ControllerGetWPIDParm(&pp,&pi,&pd,&pm);
            pp = (rxpayload->b[2] << 8 | rxpayload->b[1]);
            pi = (rxpayload->b[4] << 8 | rxpayload->b[3]);
            pd = (rxpayload->b[6] << 8 | rxpayload->b[5]); 
            ControllerSetWPIDParm(pp,pi,pd,pm);
        }break;
        
