robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2foc-icubProto/app-added/can_icubProto_parser.c
    }

#endif    
}

static int s_canIcubProtoParser_parse_canLoaderMsg(tCanData *rxpayload, unsigned char rxlen, tCanData *txpayload, unsigned char *txlen)
{
    unsigned char cmd;

    cmd = rxpayload->b[0];
    *txlen = 0;
	
	
	switch (cmd)
    {
        case ICUBCANPROTO_BL_BROADCAST: 
        {
            if(1 != rxlen)
            {   // incorrect number of parameters
//                *txlen = 0x1;
//                txpayload->b[0] = CAN_ERROR_INCORRECT_NUMBER_OF_PARAMETERS;
                *txlen = 0x0;
                return(0);
            }
			
			received_canloader_msg=1; // do not transmit status messages

            *txlen = 5;
            txpayload->b[0] = cmd;
            txpayload->b[1] = icubCanProto_boardType__2foc; 
            txpayload->b[2] = 1;  //TODO  //Firmware version number for BOOTLOADER c
            txpayload->b[3] = 0;  //TODO   //Firmware build number.
            txpayload->b[4] = 6;  //TODO   //Firmware build number. 
            #warning solita incoerenza tra versioni di fw sensori ed motori            
        } break;
                
    
        case ICUBCANPROTO_BL_BOARD:
        {
            asm ("reset");    // Jump to bootloader code      
        } break;
    
        case ICUBCANPROTO_BL_GET_ADDITIONAL_INFO:
        {
            ;
        } break;
    
        case ICUBCANPROTO_BL_SET_ADDITIONAL_INFO:
        {
            ;
        } break;
        
                
        default:
        {
            //ICUBPROTO_PAYLOAD_ERROR_SET(txpayload, txlen, CAN_PROTO_ERROR_UNKNOWN_COMMAND);
            *txlen = 0;
            return(0);
        } break;
        
        
    } //end switch

    return(1);    

}
